{
  "definicao": "O Analista de Governança de Dados formado por esta trilha será um profissional apto a estruturar, implementar e sustentar estratégias e processos de governança de dados nas organizações, sejam esses dados estruturados ou não estruturados. Atuará como elo entre áreas técnicas e de negócio, promovendo qualidade, segurança, conformidade e valor aos dados.",
  "ementa": [
    {
      "nivel": "Nivelamento",
      "objetivos_gerais": [
        "Compreender o papel dos dados nas organizações.",
        "Familiarizar-se com os conceitos básicos de dados.",
        "Iniciar o uso de ferramentas de consulta a dados.",
        "Introduzir conceitos de programação e manipulação de dados"
      ],
      "blocos_tematicos": [
        {
          "nome": "Alfabetização de dados",
          "descricao": "Descubra como os dados transformaram as organizações ao longo do tempo e como influenciam decisões em diferentes níveis institucionais. Neste curso, você aprenderá a identificar diferentes tipos de dados, reconhecer seu valor estratégico e entender por que o conhecimento técnico e de negócio são essenciais para extrair valor dos dados.",
          "projetos": ["Descrever diferentes usos de dados em organizações"],
          "hard_skills": [
            "Identificar diferentes tipos de dados e suas caracteristicas",
            "Identificar a importância dos dados nas instituições",
            "Compreender a evolução do papel dos dados nas intituições"
          ],
          "soft_skills": [
            "Compreender o impacto dos dados para as organizações",
            "Identificar dados como ativos relevantes e de onde se extrai valor nas insituições",
            "Endender que para extair valor dos dados é ncessário conhecimento de negócio e capacidades técnicas para extraí-los, manipulá=-los e colocalos em contexto"
          ],
          "ferramentas_principais": [
            "Draw.io"
          ],
          "cursos": []
        },
        {
          "nome": "Definições Fundamentais de dados",
          "descricao": "Compreenda o que torna um dado estruturado ou não estruturado e por que essa distinção importa na análise e na governança. Este curso desenvolve sua capacidade de classificar dados e pensar criticamente sobre suas características, preparando você para trabalhar com informações em múltiplos contextos.",
          "projetos": ["Classificar dados como estruturados e não estruturados"],
          "hard_skills": [
            "Identificar características de dados",
            "Caracterizar dados estruturados e não estruturados"
          ],
          "soft_skills": [
            "Pensamento crítico",
            "Decomposição de problemas"
          ],
          "ferramentas_principais": ["Draw.io"],
          "cursos": []
        },
        {
          "nome": "SQL para análise de dados",
          "descricao": "Aprenda a manipular bases de dados estruturadas utilizando SQL, explorando cláusulas como JOIN para responder perguntas de negócio. Através de um projeto prático, você irá criar relatórios de vendas e desenvolver uma visão analítica sólida para transformar dados brutos em insights acionáveis.",
          "projetos": [
            "Criação de um relatório de vendas por região"
          ],
          "hard_skills": [
            "Manipulação de dados estruturados",
            "Capacidade de realizar junções em dados a partir da cláusula JOIN",
            "Extração de dados de bases estruturadas"
          ],
          "soft_skills": [
            "Capacidade analítica",
            "Dcomposição de problemas",
            "Pensamento analítico",
            "Aplicação de conceitos de matemática"
          ],
          "ferramentas_principais": [
            "SQLite",
            "MySQL"
          ],
          "cursos": [
            {
              "stack": "SQLite",
              "cursos": [
                {
                  "id": 2953,
                  "nome": "SQLite online: conhecendo instruções SQL",
                  "link": "https://cursos.alura.com.br/course/sqlite-online-conhecendo-instrucoes-sql",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Introdução à programação com Python",
          "descricao": "Mergulhe nos fundamentos da programação com Python. Aprenda a manipular estruturas de dados como listas e dicionários, criar funções e automatizar tarefas simples. Com foco prático e analítico, este curso é ideal para quem está começando e quer aplicar Python na análise e manipulação de dados.",
          "projetos": [
            "Análise Básica de Dados com Python",
            "Manipulação de Estruturas de Dados"
          ],
          "hard_skills": [
            "Fundamentos de programação com Python",
            "Manipulação de dados com listas, tuplas e dicionários",
            "Criação e uso de funções, incluindo lambda",
            "Tratamento de exceções em Python",
            "Uso de list comprehension e dict comprehension"
          ],
          "soft_skills": [
            "Resolução de problemas com abordagens lógicas",
            "Pensamento crítico e analítico",
            "Atenção aos detalhes",
            "Autonomia para buscar soluções usando documentação e IA"
          ],
          "ferramentas_principais": [
            "Python",
            "Google Colab",
            "VS Code",
            "Bibliotecas Python (Matplotlib, random)"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
                {
                  "id": 2922,
                  "nome": "Python para Data Science: primeiros passos",
                  "link": "https://cursos.alura.com.br/course/python-data-science-primeiros-passos",
                  "status": "CARREIRA"
                },
                {
                  "id": 2923,
                  "nome": "Python para Data Science: trabalhando com funções, estruturas de dados e exceções",
                  "link": "https://cursos.alura.com.br/course/python-data-science-funcoes-estruturas-dados-excecoes",
                  "status": "CARREIRA"
                },
                {
                  "id": 4415,
                  "nome": "Praticando Python: estruturas de dados",
                  "link": "https://cursos.alura.com.br/course/praticando-python-estruturas-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "nivel": "Iniciante",
      "objetivos_gerais": [
        "Entender os fundamentos da Governança de Dados.",
        "Explorar os papéis, domínios e políticas de governança.",
        "Aplicar os conceitos básicos em projetos práticos e contextualizados."
      ],
      "blocos_tematicos": [
        {
          "nome": "Introdução à Governança de dados",
          "descricao": "Entenda o que é governança de dados, seus principais conceitos e a importância estratégica desse pilar nas organizações. Aprenda sobre a DAMA, uma das principais organizações que contribuem para a governança de dados e o DMBOK, nas diferenças entre governança e gestão de dados, e identifique os principais atores e responsabilidades envolvidos em iniciativas de governança.",
          "projetos": ["Descrever conceitos e definições de governança e as diferenças entre governança e gestão de dados"],
          "hard_skills": [
            "Identificar atores e responsabilidades em Governança de dados",
            "Diferenciar Governança e Gestão de Dados",
            "Identificar iniciativas de governança de dados"
          ],
          "soft_skills": [
            "Pensamento sistêmico",
            "Capacidade analítica"
          ],
          "ferramentas_principais": [
            "Draw.io"
          ],
          "cursos": [{
            "stack": "Python",
            "cursos":[
            
            {
              "id": 3713,
              "nome": "Governança de dados: explorando os conceitos fundamentais",
              "link": "https://www.alura.com.br/curso-online-governanca-dados-explorando-conceitos-fundamentais",
              "status": "CARREIRA"
            }
          ]
        }]
        },
        {
          "nome": "Papéis em Governança de dados",
          "descricao": "Conheça os papéis essenciais em uma estrutura de governança de dados, como Data Steward, Data Owner e CDO. Compreenda as responsabilidades de cada perfil e como eles se articulam dentro da organização para garantir a qualidade, a conformidade e o uso eficiente dos dados.",
          "projetos": ["Criação de material de divulgação sobre os papéis em governança de dados"],
          "hard_skills": [
            "Entendimento das responsabilidades de Data Owner, Data Steward, CDO e outros papéis",
            "Análise de estruturas organizacionais voltadas a dados"
          ],
          "soft_skills": [
            "Comunicação interpessoal",
            "Capacidade de articulação entre áreas",
            "Pensamento sistêmico"
          ],
          "ferramentas_principais": [
            "Draw.io"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos": [
            
            {
              "id": 3713,
              "nome": "Governança de dados: explorando os conceitos fundamentais",
              "link": "https://www.alura.com.br/curso-online-governanca-dados-explorando-conceitos-fundamentais",
              "status": "CARREIRA"
            }
          ]
        }]
        },
        {
          "nome": "Motivadores de Governança de dados",
          "descricao": "Explore os motivos que impulsionam iniciativas de governança de dados nas organizações, como competitividade, eficiência, conformidade e como a governança é necessária para habilitar as iniciativas de IA. Aprenda a identificar motivadores em diferentes cenários e argumentar sobre o valor estratégico da governança para o negócio.",
          "projetos": ["Identificar e elencar, dado um cenário, os principais motivadores da iniciativa de governança de dados"],
          "hard_skills": [
            "Identificação de riscos e oportunidades relacionados a dados",
            "Mapeamento de requisitos de compliance e governança",
            "Mapeamento de riscos relacionados ao uso de dados nas instituições"
          ],
          "soft_skills": [
            "Visão estratégica",
            "Argumentação e defesa de ideias",
            "Pensamento crítico"
          ],
          "ferramentas_principais": [],
          "cursos": [
            {
            "stack": "Python",
              "cursos": [
            {
              "id": 3713,
              "nome": "Governança de dados: explorando os conceitos fundamentais",
              "link": "https://www.alura.com.br/curso-online-governanca-dados-explorando-conceitos-fundamentais",
              "status": "CARREIRA"
            }
          ]}
          ]
        },
        {
          "nome": "Ciclo de vida dos dados",
          "descricao": "Compreenda as etapas do ciclo de vida dos dados — da criação à eliminação — e a importância de mapear esse processo para garantir controle, valor e segurança ao longo do tempo. Neste curso, você desenvolverá a visão sistêmica necessária para atuar na governança em diferentes fases do dado.",
          "projetos": [
            "Desenhar o ciclo de vida de dados de uma organização"
          ],
          "hard_skills": [
            "Análise e definição de ciclo de vida aplicado à dados",
            "Engenharia de Prcessos",
            "Análise de processos"
          ],
          "soft_skills": [
            "Visão Sistêmica",
            "Decomposição de problemas"
          ],
          "ferramentas_principais": [
            "Draw.io"
          ],
          "cursos": [
            {
              "stack":"Python",
              "cursos": [
            
            {
              "id": 3714,
              "nome": "Governança de dados: conhecendo o ciclo de vida dos dados",
              "link": "https://www.alura.com.br/curso-online-governanca-dados-conhecendo-ciclo-vida-dados",
              "status": "CARREIRA"
            }
          ]
        }]
        },
        {
          "nome": "Políticas de governança de dados",
          "descricao": "Clareza no processo e nas responsabilidades. Plano de Comunicação. ",
          "projetos": [
            "Plano de comunicação para adoção de política"
          ],
          "hard_skills": [
            "Redação de políticas e procedimentos técnicos",
            "Estruturação de planos de comunicação",
            "Mapeamento de stakeholders"
          ],
          "soft_skills": [
            "Escrita formal e objetiva",
            "Organização e sistematização de ideias",
            "Comunicação assertiva"
          ],
          "ferramentas_principais": [],
          "cursos": []
        },
        {
          "nome": "Metadados",
          "descricao": "Descubra o papel dos metadados na governança de dados e como eles ajudam a contextualizar, localizar e entender ativos de dados. Você irá explorar categorias como metadados técnicos, operacionais, de negócio e descritivos, e aprender a extrair metadados de diferentes formatos.",
          "projetos": ["Extração de metadados de tabelas, imagens e vídeos"],
          "hard_skills": [
            "Identificar e caracterizar diferentes tipos de metadados",
            "Relacionar metadados técnicos, de negócio, descritivos e operacionais com contextos organizacionais"
          ],
          "soft_skills": [
            "Visão sistêmica",
            "Comunicação entre áreas técnicas e de negócio",
            "Organização da informação"
          ],
          "ferramentas_principais": [
            "Python",
            "Google Collab"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos" :[
                {
                  "id": 3716,
                  "nome": "Governança de dados: usando metadados para compreender dados",
                  "link": "https://www.alura.com.br/curso-online-governanca-dados-usando-metadados-compreender-dados",
                  "status": "CARREIRA"
                }
              ]
            }
          ]
        },
        {
          "nome": "Qualidade de metadados",
          "descricao": "Saiba como avaliar e melhorar a qualidade dos metadados, garantindo descrições consistentes, precisas e úteis. Utilize técnicas como IA e Fuzzy Matching para identificar inconsistências e implemente padrões que contribuam para a confiabilidade dos dados documentados.",
          "projetos": [
            "aumentar a qualidade de metadados",
            "usar técnicas qualitativas e quantitativas para melhorar a qualidade de metadados",
            "uasndo IA para gerar descrições melhores"
          ],
          "hard_skills": [
            "Aplicar técnicas de Fuzzy Matching para identificação de metadados similares",
            "Avaliar a qualidade de descrições de metadados",
            "Criar padrões de preenchimento e validação de metadados"
          ],
          "soft_skills": [
            "Atenção aos detalhes",
            "Capacidade de avaliação crítica",
            "Pensamento analítico"
          ],
          "ferramentas_principais": [
            "Python",
            "Google Colab",
            "fuzzywuzzy"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos" : [
              {
                "id": 3716,
                "nome": "Governança de dados: usando metadados para compreender dados",
                "link": "https://www.alura.com.br/curso-online-governanca-dados-usando-metadados-compreender-dados",
                "status": "CARREIRA"
              }
          ]
          }
          ]
        },
        {
          "nome": "Linhagem de Dados e Descoberta de Ativos",
          "descricao": "Aprenda a mapear a origem, transformação e destino dos dados por meio da linhagem. Entenda como essas informações são essenciais para auditorias, rastreabilidade e confiabilidade dos dados, além de conhecer ferramentas de mercado para apoiar esse processo.",
          "projetos": [
            "Construção de grafo de linhagem de um pipeline de dados"
          ],
          "hard_skills": [
            "Mapear a origem, transformação e destino de dados",
            "Identificar ferramentas de mercado para linhagem de dados",
            "Relacionar linhagem de dados com governança e compliance"
          ],
          "soft_skills": [
            "Pensamento analítico",
            "Atenção aos detalhes",
            "Capacidade de abstração"
          ],
          "ferramentas_principais": [
            "OpenMetadata",
            "Python",
            "Draw.io"
          ],
          "cursos": [
            {
              "stack": "Python",
              "cursos" : [
              {
                "id": 3717,
                "nome": "Governança de dados: mapeando a origem e o destino com linhagem de dados",
                "link": "https://www.alura.com.br/conteudo/governanca-dados-mapeando-origem-destino-linhagem-dados",
                "status": "CARREIRA"
              }
          ]
          }
          ]
        },
        {
          "nome": "Glossário de Negócio",
          "descricao": "Construa um glossário de dados e de negócios como instrumento para promover entendimento comum entre áreas técnicas e de negócio. Aprenda a capturar, padronizar e comunicar conceitos-chave, fortalecendo a gestão do conhecimento na organização.",
          "projetos": [
            "Criação de um glossário de negócio"
          ],
          "hard_skills": [
            "Gestão do conhecimento de negócio",
            "Elaboração de glossários técnicos e de negócio",
            "Documentação de termos e definições de dados"
          ],
          "soft_skills": [
            "Comunicação entre áreas técnicas e de negócio",
            "Escuta ativa",
            "Capacidade de síntese e formalização de conceitos"
          ],
          "ferramentas_principais": [
            "Python",
            "Google Collab",
            "Draw.io"
          ],
          "cursos": []
        },
        {
          "nome": "Catálogo de dados",
          "descricao": "Compreenda a importância dos catálogos de dados na governança e explore suas diferenças em relação a inventários e marketplaces de dados. Aprenda como relacionar dados, domínios e glossários e a avaliar ferramentas de mercado para gestão e catalogação de ativos.",
          "projetos": [
            "Administrar ativos de dados em um catálogo de dados"
          ],
          "hard_skills": [
            "Compreensão do que é um catálogo de dados",
            "Relacionamento entre dados, domínios e glossários",
            "Avaliação de ferramentas de mercado para catalogação"
          ],
          "soft_skills": [
            "Capacidade de estruturar e organizar informações",
            "Pensamento sistêmico",
            "Visão de produto"
          ],
          "ferramentas_principais": [
            "Azure Purview"
          ],
          "cursos": []
        },
        {
          "nome": "Qualidade de dados",
          "descricao": "Diferencie qualidade técnica e de negócio, e aprenda a criar e automatizar regras de validação com bibliotecas Python como o Pydeequ. Entenda quem deve definir essas regras e como garantir que os dados atendam a padrões consistentes e confiáveis.",
          "projetos": [],
          "hard_skills": [
            "Criação e automação de regras de qualidade de dados",
            "Diferenciação entre qualidade técnica e de negócio",
            "Utilização de bibliotecas Python para validação de dados"
          ],
          "soft_skills": [
            "Capacidade de diagnóstico",
            "Resolução de problemas",
            "Colaboração multidisciplinar"
          ],
          "ferramentas_principais": [
            "Google collaboratory",
            "Python",
            "Pydeequ"
          ],
          "cursos": [
          {
            "stack": "Python",
              "cursos": [
            {
            "id": 3715,
            "nome": "Governança de dados: garantindo a qualidade de dados com a biblioteca Pydeequ",
            "link": "https://www.alura.com.br/curso-online-governanca-dados-qualidade-dados-biblioteca-pydeequ?srsltid=AfmBOoo3fjdLsgLxg9oQJ0fLV9Nyc-vyi7i9b0WB2xZ4boH9P4PfxpYR",
            "status": "CARREIRA"
            }
            ]
          }
          ]
        },
        {
          "nome": "Projeto Integrador - Criando uma Política de Privacidade de dados",
          "descricao": "Neste projeto integrador, o aluno colocará em prática os conhecimentos adquiridos ao longo do nível, elaborando uma política de privacidade de dados baseada em normas e boas práticas de mercado, levando em conta os o ciclo de vida dos dados e papéis e responsabilidades envolvidos",
          "projetos": [
            "Documento de política de privacidade",
            "Apresentação do plano de comunicação da política de privacidade"
          ],
          "hard_skills": [
            "Interpretação da LGPD e outras legislações",
            "Escrita de documentos técnicos",
            "Aplicação de princípios de governança"
          ],
          "soft_skills": [
            "Responsabilidade ética",
            "Atenção aos detalhes",
            "Leitura e Interpretação de documentos técnicos e jurídicos"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "Editor de texto"
          ],
          "cursos": []
        }
      ]
    },
    {
      "nivel": "Intermediário",
      "objetivos_gerais": [
        "Explorar estratégias organizacionais e carreiras em Governança.",
        "Investigar a relação com IA, ontologias e arquitetura empresarial.",
        "Projetar soluções de governança em contextos complexos."
        ],
      "blocos_tematicos": [
        {
          "nome": "Priorização ou Criticidade de dados",
          "descricao": "Aprenda a identificar quais ativos de dados são mais críticos para a organização e como priorizá-los com base em critérios técnicos e de negócio. Desenvolva modelos práticos que consideram frequência de acesso, valor estratégico e impacto para decisões corporativas.",
          "projetos": [
            "Criar um modelo de priorizaçõ de dados baseado em acesso"
          ],
          "hard_skills": [
            "Entender como priorizar dados"
          ],
          "soft_skills": [
            "Priorização de ações e ativos"
          ],
          "ferramentas_principais": [
            "Python",
            "Google Collaboratory"
          ],
          "cursos": []
        },
        {
          "nome": "Segurança de Dados",
          "descricao": "Entenda como proteger dados ao longo de seu ciclo de vida, aplicando princípios como acesso mínimo, controle de permissões e monitoramento de uso. Aprenda a prevenir vazamentos e garantir conformidade com legislações como a LGPD, alinhando governança e segurança da informação.",
          "projetos": ["Criação de um processo para garantir o conformidade com a LGPD"],
          "hard_skills": [
            "Mapeamento de acessos e permissões",
            "Aplicação do princípio do menor privilégio",
            "Identificação de riscos e prevenção de vazamentos"
          ],
          "soft_skills": [
            "Responsabilidade ética",
            "Atenção aos detalhes",
            "Conscientização de segurança"
          ],
          "ferramentas_principais": [
            "Python, Draw.io"
          ],
          "cursos": []
        },        
      
        {
          "nome": "Master Data Management",
          "descricao": "Descubra o papel dos dados mestres na integração e consistência de informações dentro das organizações. Aprenda a identificar, organizar e governar esses dados, considerando escopo, centralização e uso estratégico em diferentes contextos de negócio.",
          "projetos": ["Criação de uma base de master data"],
          "hard_skills": [
            "Identificação de dados mestres e de referência",
            "Definição de escopos e governança de MDM",
            "Avaliação de modelos centralizados e distribuídos"
          ],
          "soft_skills": [
            "Visão estratégica",
            "Capacidade de articulação entre áreas",
            "Pensamento sistêmico"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "Excel",
            "Plataformas MDM (overview)"
          ],
          "cursos": []
        },
        {
          "nome": "Dados de Referência",
          "descricao": "Explore o que são dados de referência e como eles se relacionam com o MDM. Aprenda a identificar, padronizar e documentar esses dados para garantir consistência entre sistemas e processos, promovendo a interoperabilidade e a qualidade da informação.",
          "projetos": ["Criação de uma tabela de referência"],
          "hard_skills": [
            "Identificação de dados mestres e de referência",
            "Definição de escopos de dados de referência",
            "Criação de standarts de dados"
          ],
          "soft_skills": [
            "Visão estratégica",
            "Capacidade de articulação entre áreas",
            "Pensamento sistêmico"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "Excel",
            "Plataformas MDM (overview)"
          ],
          "cursos": []
        },
         {
          "nome": "Enterprise Data Standards",
          "descricao": "Aprenda a criar e implementar padrões de dados (data standards) para promover consistência, reutilização e governança em larga escala. Entenda como formalizar definições, regras e formatos que sustentam a integridade e a compreensão dos dados em toda a organização.",
          "projetos": ["Criação de uma política de data standards"],
          "hard_skills": [
            "Gerenciamento do conhecimento",
            "Definição standards",
            "Criação de standarts de dados"
          ],
          "soft_skills": [
            "Visão estratégica",
            "Capacidade de articulação entre áreas",
            "Pensamento sistêmico"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "Excel",
            "Python"
          ],
          "cursos": []
        },
        {
          "nome": "Engenharia e Qualidade de dados",
          "descricao": "Aprofunde-se na relação entre engenharia de dados e qualidade. Avalie dados nos pipelines de ETL e crie requisitos técnicos de validação. Este curso é voltado para integrar boas práticas de governança na engenharia de dados, assim como discutir a responsabilidade da qualidade de dados em difrentes estapas do processo de uso dos dados.",
          "projetos": [],
          "hard_skills": [
            "Análise de ETLs com foco em qualidade de dados",
            "Criação de requisitos técnicos para validação de dados",
            "Integração de testes de qualidade em pipelines"
          ],
          "soft_skills": [
            "Colaboração com times técnicos",
            "Atenção aos detalhes",
            "Pensamento lógico"
          ],
          "ferramentas_principais": [
            "Python",
            "Pydeequ",
            "Apache Airflow"
          ],
          "cursos": []
        },
        {
          "nome": "Governança e Arquitetura de dados",
          "descricao": "Explore como diferentes modelos de arquitetura (centralizada, distribuída, federada) impactam a governança. Relacione decisões arquiteturais com maturidade organizacional e descubra como alinhar estratégias técnicas às necessidades de conformidade e controle.",
          "projetos": [],
          "hard_skills": [
            "Relacionar modelos arquiteturais com práticas de governança",
            "Mapear impactos de centralização ou descentralização de dados",
            "Alinhar estratégias técnicas com requisitos de governança"
          ],
          "soft_skills": [
            "Visão de arquitetura",
            "Capacidade analítica",
            "Tradução de requisitos de negócio para soluções técnicas"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "PowerPoint",
            "Lucidchart"
          ],
          "cursos": []
        },
        {
          "nome": "Governança e Business Inteligence",
          "descricao": "Entenda o papel da governança no processo de criação de dashboards e indicadores de BI. Aprenda a estabelecer regras e padrões para o uso de dados em relatórios, promovendo alinhamento entre as áreas técnicas e o negócio, com foco em segurança e confiabilidade.",
          "projetos": ["Criar as definições de governança para o processo de criação de novos dashboards de BI"],
          "hard_skills": [
            "Entender o processo de demanda de business intellingence",
            "Identificar a importância da governança no processo de criação de BI",
            "Caracterizar BI como uma interface de dados com o negócio"
          ],
          "soft_skills": [
            "Visão de arquitetura",
            "Capacidade analítica",
            "Criação de guardrails técnicos"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "PowerPoint",
            "Lucidchart"
          ],
          "cursos": []
        },
        {
          "nome": "Comunicação para profissionais em governança",
          "descricao": "Desenvolva habilidades de comunicação essenciais para profissionais de governança de dados. Trabalhe conceitos como identificação de personas, tom de voz e estratégias de engajamento para dialogar de forma clara e eficaz com diferentes públicos da organização.",
          "projetos": [],
          "hard_skills": [
            "Identificação de Personas",
            "Comunicação técnica"
          ],
          "soft_skills": [
            "Comunicação assertiva",
            "Pensamento crítico"          ],
          "ferramentas_principais": [],
          "cursos": []
        },
        {
          "nome": "Projeto integrador - Mapeamento do processo end-to-end de ingestão",
          "descricao": "Neste projeto final do nível intermediário, você irá mapear todo o processo de ingestão de dados — da demanda de negócio até o carregamento em um data lake. O desafio envolve documentação técnica, visão de processo e alinhamento com os requisitos de governança.",
          "projetos": [
            "Mapeamento do proceso end-to-end",
            "Documentação dos requisitos de governança"
          ],
          "hard_skills": [
            "Engenharia de Prcessos",
            "Documentação de requisitos técnicos"
          ],
          "soft_skills": [
            "Organização e documentação",
            "Visão sistêmica",
            "Colaboração entre áreas"
          ],
          "ferramentas_principais": [
            "Google Colab",
            "Draw.io"
          ],
          "cursos": []
        }
      ]
    },
    {
      "nivel": "Avançado",
      "objetivos_gerais": [
        "Explorar estratégias organizacionais e carreiras em Governança.",
        "Investigar a relação com IA, ontologias e arquitetura empresarial.",
        "Projetar soluções de governança em contextos complexos."
      ],
      "blocos_tematicos": [
        {
          "nome": "Diferentes Perfis e Carreiras em governança de dados",
          "descricao": "Conheça os diversos papéis envolvidos na governança de dados — como analistas de MDM, qualidade, Data Steward e arquitetos de dados — e entenda como cada função contribui para o ecossistema de dados. Explore caminhos de carreira e descubra como estruturar equipes com competências complementares. Entenda como cada função é mais associada à um perfil de profissional e entenda melhor as organizações que mais precisam de governança de dados.",
          "projetos": ["Analisar os perils e carreiras e entender qual pode ser o mais apropriado para você."],
          "hard_skills": [
            "Identificar competências de cada papel na governança",
            "Relacionar responsabilidades com estruturas organizacionais",
            "Mapear perfis profissionais e trajetórias de carreira"
          ],
          "soft_skills": [
            "Autoconhecimento",
            "Visão organizacional",
            "Comunicação interpessoal"
          ],
          "ferramentas_principais": [
            "Miro",
            "Draw.io"
          ],
          "cursos": []
        },
        {
          "nome": "Governança de dados na Cloud",
          "descricao": "Explore como a governança de dados é aplicada em ambientes de nuvem como Azure, AWS e GCP. Conheça os principais serviços disponíveis para catalogação, controle de acesso e compliance, e aprenda a avaliar trade-offs e arquiteturas multicloud com foco em governança",
          "projetos": ["Descrever as diferentes ferramentas de governança de dados em provedores de cloud AWS, Azure e Google."],
          "hard_skills": [
            "Conhecimento de serviços de governança em nuvem (Azure, AWS, GCP)",
            "Comparar soluções de catálogos, segurança e compliance na nuvem",
            "Avaliação de trade-offs entre ferramentas cloud"
          ],
          "soft_skills": [
            "Curiosidade tecnológica",
            "Capacidade de adaptação",
            "Aprendizagem contínua"
          ],
          "ferramentas_principais": [
            "Azure Purview",
            "AWS Glue",
            "Google Cloud Data Catalog"
          ],
          "cursos": []
        },
        {
          "nome": "Produtos de Dados",
          "descricao": "Compreenda o conceito de produtos de dados e a abordagem de “dados como produto”. Aprenda a conectar ativos técnicos às necessidades do negócio e desenvolva uma mentalidade de produto para construir soluções escaláveis, reutilizáveis e orientadas ao cliente interno.",
          "projetos": ["Criação da documentação de um produto de dados e todos os ativos relacionados à eles"],
          "hard_skills": [
            "Compreensão de produtos de dados",
            "Relacionar dados com objetivos de negócio",
            "Criação de planos de entrega e consumo de dados"
          ],
          "soft_skills": [
            "Mentalidade de produto",
            "Orientação ao cliente interno",
            "Colaboração entre times"
          ],
          "ferramentas_principais": [
            "Notion",
            "Jira",
            "Miro"
          ],
          "cursos": []
        },
        {
          "nome": "Camada Semântica",
          "descricao": "Descubra como a camada semântica facilita o entendimento compartilhado entre áreas técnicas e de negócio. Aprenda a modelar conceitos, entidades e métricas de forma lógica, conectando os dados físicos à linguagem de negócios por meio de ferramentas como Power BI .",
          "projetos": [],
          "hard_skills": [
            "Modelagem de conceitos e entidades de negócio",
            "Relacionamento entre dados físicos e entidades lógicas",
            "Aplicação de camadas semânticas em soluções de BI"
          ],
          "soft_skills": [
            "Capacidade de abstração",
            "Comunicação entre times técnicos e de negócio",
            "Pensamento conceitual"
          ],
          "ferramentas_principais": [
            "Power BI",
            "Ferramentas de modelagem semântica"
          ],
          "cursos": []
        },
      
        {
          "nome": "Ontologia orientada à dados",
          "descricao": "Explore os fundamentos das ontologias aplicadas a dados e como modelos orientados a ontologia apoiam o entendimento, a padronização e a integração de informações. Descubra como essas abordagens impulsionam soluções em contextos complexos e automatizados.",
          "projetos": [],
          "hard_skills": [
            "Ontologia orientada a dados",
            "Capacidade de descrever conceitos e entidades",
            "Escrita clara e objetiva"
          ],
          "soft_skills": [
            "Capacidade de criar definições claras",
            "Capacidade de mediação",
            "Entendimento de necessidades de diversas áreas"
            ],
          "ferramentas_principais": [],
          "cursos": []
        },
        {
          "nome": "A ponte entre o negócio e os dados",
          "descricao": "Aprenda a construir conexões efetivas entre áreas técnicas e de negócio. Desenvolva habilidades de escuta, facilitação e tradução de requisitos para garantir que soluções de dados estejam alinhadas com os objetivos estratégicos da organização.",
          "projetos": ["Criar um plano para abordar e educar unidades de negócio em governança de dados. Atender demandas de governança de dados"],
          "hard_skills": [
            "Tradução de requisitos de negócio em soluções técnicas",
            "Facilitação de workshops de entendimento de dados",
            "Modelagem de necessidades de negócio"
          ],
          "soft_skills": [
            "Empatia organizacional",
            "Comunicação eficaz",
            "Capacidade de mediação"
          ],
          "ferramentas_principais": [
            "Miro",
            "Draw.io",
            "Notion"
          ],
          "cursos": []
        },
        {
          "nome": "Governança de dados e Governança de TI",
          "descricao": "Explore as diferenças e intersecções entre governança de dados e governança de TI. Relacione frameworks como COBIT e DAMA-DMBOK e compreenda como alinhar os dois domínios para fortalecer a governança corporativa de forma integrada.",
          "projetos": ["Identificar e relacionar Funções de Negócio e os domínios de dados"],
          "hard_skills": [
            "Diferenciar governança de dados e de TI",
            "Relacionar frameworks (COBIT, DAMA-DMBOK)",
            "Analisar estruturas de governança corporativa"
          ],
          "soft_skills": [
            "Pensamento estratégico",
            "Capacidade de articulação",
            "Compreensão organizacional"
          ],
          "ferramentas_principais": [
            "Draw.io",
            "Miro",
            "PowerPoint"
          ],
          "cursos": []
        },
        {
          "nome": "Estratégia de dados",
          "descricao": "Entenda como construir uma estratégia de dados alinhada aos objetivos de negócio. Compreenda por que a governança é condição essencial para escalar o uso de dados e como integrar dados, pessoas e processos para gerar impacto sustentável.",
          "projetos": [
            "Identificar riscos dos projetos de dados",
            "Avaliar os pilares da estratégias de dados de uma organização"
          ],
          "hard_skills": [
            "Identificar conceitos de estretégia de dados",
            "Identificação de riscos organizacionais"
          ],
          "soft_skills": [
            "relacionar conceitos de negócio e de dados",
            "Compreender a estratégia de dados como parte da estratégia da organização"
          ],
          "ferramentas_principais": ["Draw.io"],
          "cursos": []
        },
        {
          "nome": "Maturidade de dados",
          "descricao": "Aprenda a avaliar a maturidade de iniciativas de governança de dados com base em indicadores e frameworks. Descubra como identificar lacunas, propor melhorias e estruturar planos de evolução da maturidade organizacional no uso e gestão dos dados.",
          "projetos": [
            "Avaliação da maturidade de organização em relação à dados",
            "Reconhecer heterogeniedade em difrentes unidades de negócio",
            "Entender expectativas"
          ],
          "hard_skills": [
            "Avaliar indicadores de maturidade de dados na organização",
            "Avaliar a maturidade das ações de governança de dados na organização"
          ],
          "soft_skills": [
            "Capacidade de avaliação de maturidade",
            "Comunicação com áreas de negócio"
          ],
          "ferramentas_principais": ["Draw.io"],
          "cursos": []
        },
        {
          "nome": "Projeto integrador - Identificando gaps entre a maturidade de dados da organização e a estratégia",
          "descricao": "Neste projeto integrador, você irá desenvolver uma abordagem baseada em dados para medir a maturidade de diferentes domínios da organização. A partir disso, será realizada uma analise comparativa entre os objetivos estratégicos de dados e a maturidade da organização e suas unidades de negócio. Além de identificar oportunidades de evolução, você será responsável por documentar os requisitos técnicos e de governança necessários.",
          "projetos": [
            "Criação de uma forma de medir a maturidade",
            "Documentação dos requisitos de governança"
          ],
          "hard_skills": [
            "Engenharia de Prcessos",
            "Documentação de requisitos técnicos"
          ],
          "soft_skills": [
            "Comunicação com áreas de negócio",
            "Visão sistêmica",
            "Colaboração entre áreas"
          ],
          "ferramentas_principais": [
            "Google Colab",
            "Draw.io"
          ],
          "cursos": []
        }
      ]
    }
  ]
}