[
  {
    "nome": "Linhagem de Dados e Descoberta de Ativos",
    "descricao": "Técnicas e ferramentas para rastreamento e visualização da linhagem de dados. A importância da descoberta ativa de dados para governança.",
    "projetos": [
      "Construção de grafo de linhagem de um pipeline de dados"
    ],
    "hard_skills": [
      "Mapear a origem, transformação e destino de dados",
      "Identificar ferramentas de mercado para linhagem de dados",
      "Relacionar linhagem de dados com governança e compliance"
    ],
    "soft_skills": [
      "Pensamento analítico",
      "Atenção aos detalhes",
      "Capacidade de abstração"
    ],
    "ferramentas_principais": [
      "OpenLineage",
      "Marquez",
      "Python",
      "Draw.io"
    ],
    "cursos": []
  },
  {
    "nome": "Governança de Dados para Inteligência Artificial",
    "descricao": "Princípios e práticas de governança aplicados a dados utilizados por modelos de machine learning. Foco em auditabilidade, explicabilidade, viés e uso responsável dos dados.",
    "projetos": [
      "Checklist de governança para pipeline de machine learning"
    ],
    "hard_skills": [
      "Aplicar princípios de fairness, explicabilidade e auditabilidade",
      "Analisar riscos de uso indevido de dados em IA",
      "Definir critérios de conformidade para projetos de IA"
    ],
    "soft_skills": [
      "Pensamento crítico",
      "Responsabilidade ética",
      "Visão sistêmica"
    ],
    "ferramentas_principais": [
      "MLFlow",
      "Fairlearn",
      "Python",
      "Documentos de governança"
    ],
    "cursos": []
  },
  {
    "nome": "Gestão Técnica de Metadados e Catálogos",
    "descricao": "Aprofundamento em metadados técnicos e operacionais, com foco na arquitetura e integração de catálogos de dados em plataformas corporativas.",
    "projetos": [
      "Mapear metadados técnicos em um ambiente analítico",
      "Integrar catálogo técnico com glossário de negócio"
    ],
    "hard_skills": [
      "Mapeamento e estruturação de metadados operacionais",
      "Integração de fontes de metadados com ferramentas de catalogação",
      "Avaliação de plataformas de metadados do mercado"
    ],
    "soft_skills": [
      "Organização da informação",
      "Capacidade de documentação",
      "Colaboração técnica"
    ],
    "ferramentas_principais": [
      "Apache Atlas",
      "DataHub",
      "Collibra",
      "Draw.io"
    ],
    "cursos": []
  },
  {
    "nome": "Auditoria e Automação em Governança com DataOps",
    "descricao": "Fundamentos de DataOps aplicados à governança de dados. Uso de pipelines automatizados com checkpoints de qualidade e controle de versões.",
    "projetos": [
      "Construção de pipeline com validações automatizadas de qualidade de dados"
    ],
    "hard_skills": [
      "Automação de verificações de qualidade de dados",
      "Auditoria de pipelines de dados",
      "Integração de testes com CI/CD"
    ],
    "soft_skills": [
      "Mentalidade de melhoria contínua",
      "Trabalho colaborativo",
      "Rigor técnico"
    ],
    "ferramentas_principais": [
      "dbt",
      "Great Expectations",
      "GitHub Actions",
      "Apache Airflow"
    ],
    "cursos": []
  },
  {
    "nome": "Ética e Responsabilidade no Ciclo de Vida dos Dados",
    "descricao": "Discussão sobre dilemas éticos, responsabilidade no uso dos dados, e impacto social das decisões orientadas a dados. Aplicações em contextos reais.",
    "projetos": [
      "Análise de caso sobre uso inadequado de dados com proposta de mitigação"
    ],
    "hard_skills": [
      "Identificar riscos éticos no uso de dados",
      "Relacionar aspectos legais, sociais e morais de decisões baseadas em dados",
      "Aplicar princípios de uso responsável de dados"
    ],
    "soft_skills": [
      "Responsabilidade ética",
      "Análise crítica",
      "Tomada de decisão consciente"
    ],
    "ferramentas_principais": [
      "Documentação legal",
      "Estudos de caso",
      "Mapas de impacto"
    ],
    "cursos": []
  }
]